task-gt/task-c/openfoam/task-06/init_file/plate_base/system/blockMeshDict
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
convertToMeters 1;

vertices
(
    (0 0 0)
    (0.2 0 0)
    (1.2 0 0)
    (1.5 0 0)
    (0 0.4 0)
    (0.2 0.4 0)
    (1.2 0.4 0)
    (1.5 0.4 0)
    (0 0 0.01)
    (0.2 0 0.01)
    (1.2 0 0.01)
    (1.5 0 0.01)
    (0 0.4 0.01)
    (0.2 0.4 0.01)
    (1.2 0.4 0.01)
    (1.5 0.4 0.01)
);

blocks
(
    hex (0 1 5 4 8 9 13 12) (40 100 1) simpleGrading (1 2 1)
    hex (1 2 6 5 9 10 14 13) (200 120 1) simpleGrading (1 4 1) // TODO_WALL_REFINEMENT
    hex (2 3 7 6 10 11 15 14) (60 100 1) simpleGrading (1 2 1)
);

boundary
(
    inlet
    {
        type patch;
        faces ((0 4 12 8));
    }
    outlet
    {
        type patch;
        faces ((3 7 15 11));
    }
    top
    {
        type patch;
        faces
        (
            (4 5 13 12)
            (5 6 14 13)
            (6 7 15 14)
        );
    }
    upstreamWall
    {
        type wall;
        faces ((0 1 9 8));
    }
    plate
    {
        type wall;
        faces ((1 2 10 9)); // TODO_PLATE_REGION
    }
    downstreamWall
    {
        type wall;
        faces ((2 3 11 10));
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (8 12 13 9)
            (1 2 6 5)
            (9 13 14 10)
            (2 3 7 6)
            (10 14 15 11)
        );
    }
);
